02_OpenFOAM_FVM/cases/Ejercicio4/Parte1_FVM/OneDScalar_20celdas_u25/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  constant;

// Gamma = rho * nu => nu = Gamma/rho = 0.1/1 = 0.1 m2/s
nu              0.1;

// ************************************************************************* //
