02_OpenFOAM_FVM/cases/Ejercicio4/Parte1_FVM/OneDScalar_20celdas_u25/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Velocidad u = 2.5 m/s (Caso 3 del enunciado, 20 celdas)
internalField   uniform (2.5 0 0);

boundaryField
{
    in
    {
      type            fixedValue;
      value $internalField;
    }
    out
    {
        type            fixedValue;
	value $internalField;
    }

    emptywalls
    {
        type            empty;
    }
}


// ************************************************************************* //
