02_OpenFOAM_FVM/cases/Ejercicio4/Parte1_FVM/OneDScalar_20celdas_u25/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    in
    {
      type            fixedValue;
      value uniform 0;
    }
    out
    {
        type            fixedValue;
	value uniform 0;
    }

    emptywalls
    {
        type            empty;
    }
}
